X0 = -2; %метры
M = 9e-31; %килограммы
Q0 = 1.6e-19; %Кулоны
Q = -1.2e-18; %Кулоны
V0 = 0; %м/с
e0 = 8.854187817e-12; %Ф/м
k = 1/(4*pi*e0); %м/Ф
T1 = 2.5*10*(16*M/(k*Q*Q0))^(1/2)
DT = 1e-2*T1;
Y = [X0, V0];
T = 0;
i = 1;
while T(i, 1) < T1
  i = i + 1;
  V = Y(i - 1, 2);
  X = Y(i - 1, 1);
  Y(i, :) = Y(i - 1, :) + [X, abs(M*k*Q*Q0/(X)^2)]*DT;
  T(i, 1) = T(i - 1, 1) + DT;
end
plot(T, Y(:, 1));
grid on

X0 = -1; %метры
M = 6e-31; %килограммы
Q0 = 1.8e-19; %Кулоны
Q = -1.4e-18; %Кулоны
V0 = 0; %м/с
e0 = 8.854187817e-12; %Ф/м
k = 1/(4*pi*e0); %м/Ф
T1 = 2.5*10*(8*M/(k*Q*Q0))^(1/2);
DT = 1e-2*T1;
Y = [X0, V0];
T = 0;
i = 1;
while T(i, 1) < T1
  i = i + 1;
  V = Y(i - 1, 2);
  X = Y(i - 1, 1);
  Y(i, :) = Y(i - 1, :) + [X, abs(M*k*Q*Q0/(X)^2)]*DT;
  T(i, 1) = T(i - 1, 1) + DT;
end
%plot(T, Y(:, 1));
%grid on